describe('进度表',function(){
    var final_result = "***<南哈蒙理工大学>学分明细***"+'\n'
                        +'----------------------'+'\n'
                        +'已修课程学分：'+'\n'
                        +'必修：14'+'\n'
                        +'选修：2'+'\n'
                        +'----------------------'+'\n'
                        +'社会实践：'+'\n'
                        +'已折算成必修课的学分：4'+'\n'
                        +'已折算成选修课的学分：2'+'\n'
                        +'----------------------'+'\n'
                        +'已获得的总学分：'+'\n'
                        +'必修：14'+'\n'
                        +'选修：4'+'\n'
                        +'离顺利毕业还差学分：'+'\n'
                        +'必修：26'+'\n'
                        +'选修：16'+'\n'
                        +'----------------------'+'\n'
                        +'顺利毕业的所有课程平均分基线：70'+'\n'
                        +'当前所有课程平均分：70.8'+'\n'
                        +'**********************' ;
    //console.log(final_result);
});